#include"InputControl.h"
#include"Dxlib.h"

/**************************************
*マクロ定義
**************************************/
#define XINPUT_BUTTON_MAX (16)           //コントローラーのボタン数
/*************************************
*型定義
**************************************/
enum KEY_STATE
{
	E_NONE,    //未入力
	E_CLICK,   //押した瞬間
	E_PRESS,   //押し続けている
	E_RELEASED,//離した
	E_KEY_STATE_MAX
};
/*****************************************
*変数宣言
*****************************************/
KEY_STATE button_state[XINPUT_BUTTON_MAX];  //各ボタン入力状態